Tekla Open API Reference for Tekla Structures 2025
Task.Critical Property
 The criticality of the task.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Critical { get; set; }
Public Property Critical As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Task Class
Tekla.Structures.Model Namespace